cases/supersonicEjector/hisa/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293; 

boundaryField
{
    axis
    {
        type            empty;
    }
    inletMain
    {
        type            characteristicPressureInletOutletTemperature;
        #include	"include/freestreamConditions"
        value           uniform 293; 
    }
    outlet
    {
	type		characteristicFarfieldTemperature;
	#include	"include/freestreamConditions"
	value		uniform 293;
    }
    inletSecondary
    {
        type            characteristicPressureInletOutletTemperature;
        #include        "include/freestreamConditions"
        value           uniform 293;
    }
    wallNozzle1
    {
        type            characteristicWallTemperature;
    }
    wallInletSecondary
    {
        type            characteristicWallTemperature;
    }
    wallDiffuser
    {
        type            characteristicWallTemperature;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
