cases/supersonicEjector/hisa/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.01";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    axis
    {
        type            empty;
    }
    inletMain
    {
        type            characteristicPressureInletOutletVelocity; //pressureInletOutletVelocity;
	#include	"include/freestreamConditions"
        value           uniform (0 0 0); 
    }
    outlet
    {
	type		characteristicFarfieldVelocity;
	#include        "include/freestreamConditions"
	value		uniform (0 0 0);
    }
    inletSecondary
    {
        type            characteristicPressureInletOutletVelocity; //pressureInletOutletVelocity;
        #include        "include/freestreamConditions"
        value           uniform (0 0 0); 
    }
    wallNozzle1
    {
        type            boundaryCorrectedFixedValue;
#include        "include/freestreamConditions"
value           uniform (0 0 0);
    }
    wallInletSecondary
    {
        type            boundaryCorrectedFixedValue;
#include        "include/freestreamConditions"
value           uniform (0 0 0);
    }
    wallDiffuser
    {
        type            boundaryCorrectedFixedValue;
#include        "include/freestreamConditions"
value           uniform (0 0 0);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
