cases/supersonicEjector/hisa/0/total(p)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      total(p);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    axis
    {
        type            empty;
    }
    inletMain
    {
        type            calculated;
        value           uniform 700000;
    }
    outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    inletSecondary
    {
        type            calculated;
        value           uniform 100000;
    }
    wallNozzle1
    {
        type            calculated;
        value           uniform 100000;
    }
    wallInletSecondary
    {
        type            calculated;
        value           uniform 100000;
    }
    wallDiffuser
    {
        type            calculated;
        value           uniform 100000;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
