cases/supersonicEjector/hisa/system/MachNo
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2512
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the Mach Number field from the velocity field.

\*---------------------------------------------------------------------------*/

type            MachNo;
libs            (fieldFunctionObjects);

field           U;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
