cases/supersonicEjector/hisa/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (                         0                         0                         0 )  // 0 vA0-z
    (                      11.5                         0                         0 )  // 1 vB0-z
    (   49.90999999999999658939                         0                         0 )  // 2 vC0-z
    (   57.05999999999999516831                         0                         0 )  // 3 vD0-z
    (   62.13361918803912686826                         0                         0 )  // 4 vEE0-z
    (   64.13192717733025460802                         0                         0 )  // 5 vF0-z
    (   84.90999999999999658939                         0                         0 )  // 6 vK0-z
    (   143.1999999999999886313                         0                         0 )  // 7 vL0-z
    (   213.7355118030932317197                         0                         0 )  // 8 vMM0-z
    (   230.4404424405884412863                         0                         0 )  // 9 vO0-z
    (   330.4404424405884128646                         0                         0 )  // 10 vP0-z
    (   49.90999999999999658939                     1.375                         0 )  // 11 vC1-z
    (   57.05999999999999516831                     1.375                         0 )  // 12 vD1-z
    (   62.13361918803912686826   2.782039128056200016914                         0 )  // 13 vEE1-z
    (                      62.5   3.263854354660511436492                         0 )  // 14 vE1-z
    (   84.90999999999999658939                      4.25                         0 )  // 15 vK1-z
    (   143.1999999999999886313                      4.25                         0 )  // 16 vL1-z
    (                    53.625   6.822890765995383688391                         0 )  // 17 vJJJ1-z
    (                         0   7.424999999999999822364                         0 )  // 18 vA1-z
    (                      11.5   7.424999999999999822364                         0 )  // 19 vB1-z
    (    66.7185832004988128574   7.457637599065291666989                         0 )  // 20 vI1-z
    (   213.7355118030932317197   7.946609534192859314317                         0 )  // 21 vMM1-z
    (                        63    11.8892724876202287021                         0 )  // 22 vH1-z
    (                       218   12.44044244058844128631                         0 )  // 23 vM1-z
    (   38.83333333333332859638    12.7546181182201703308                         0 )  // 24 vJJ1-z
    (                        27                      17.5                         0 )  // 25 vJ1-z
    (                        63                      17.5                         0 )  // 26 vG1-z
    (                       218   112.4404424405884412863                         0 )  // 27 vQ1-z
    (                         0                         0                         1 )  // 28 vA0+z
    (                      11.5                         0                         1 )  // 29 vB0+z
    (   49.90999999999999658939                         0                         1 )  // 30 vC0+z
    (   57.05999999999999516831                         0                         1 )  // 31 vD0+z
    (   62.13361918803912686826                         0                         1 )  // 32 vEE0+z
    (   64.13192717733025460802                         0                         1 )  // 33 vF0+z
    (   84.90999999999999658939                         0                         1 )  // 34 vK0+z
    (   143.1999999999999886313                         0                         1 )  // 35 vL0+z
    (   213.7355118030932317197                         0                         1 )  // 36 vMM0+z
    (   230.4404424405884412863                         0                         1 )  // 37 vO0+z
    (   330.4404424405884128646                         0                         1 )  // 38 vP0+z
    (   49.90999999999999658939                     1.375                         1 )  // 39 vC1+z
    (   57.05999999999999516831                     1.375                         1 )  // 40 vD1+z
    (   62.13361918803912686826   2.782039128056200016914                         1 )  // 41 vEE1+z
    (                      62.5   3.263854354660511436492                         1 )  // 42 vE1+z
    (   84.90999999999999658939                      4.25                         1 )  // 43 vK1+z
    (   143.1999999999999886313                      4.25                         1 )  // 44 vL1+z
    (                    53.625   6.822890765995383688391                         1 )  // 45 vJJJ1+z
    (                         0   7.424999999999999822364                         1 )  // 46 vA1+z
    (                      11.5   7.424999999999999822364                         1 )  // 47 vB1+z
    (    66.7185832004988128574   7.457637599065291666989                         1 )  // 48 vI1+z
    (   213.7355118030932317197   7.946609534192859314317                         1 )  // 49 vMM1+z
    (                        63    11.8892724876202287021                         1 )  // 50 vH1+z
    (                       218   12.44044244058844128631                         1 )  // 51 vM1+z
    (   38.83333333333332859638    12.7546181182201703308                         1 )  // 52 vJJ1+z
    (                        27                      17.5                         1 )  // 53 vJ1+z
    (                        63                      17.5                         1 )  // 54 vG1+z
    (                       218   112.4404424405884412863                         1 )  // 55 vQ1+z
);

edges
(
  arc 33 42 (  63.5868635001019   1.91914636054038                  1) // edgeFE+z (vF0+z vE1+z)
  arc 5 14 (  63.5868635001019   1.91914636054038                  0) // edgeFE-z (vF0-z vE1-z)
  arc 41 42 (  62.3980010012673   2.96120736063906                  1) // edgeEEE+z (vEE1+z vE1+z)
  arc 13 14 (  62.3980010012673   2.96120736063906                  0) // edgeEEE-z (vEE1-z vE1-z)
  arc 49 51 (  216.947199994035   9.54789819699901                  1) // edgeMMM+z (vMM1+z vM1+z)
  arc 21 23 (  216.947199994035   9.54789819699901                  0) // edgeMMM-z (vMM1-z vM1-z)
  arc 37 51 (  226.796721210701   8.79672121070101                  1) // edgeOM+z (vO0+z vM1+z)
  arc 9 23 (  226.796721210701   8.79672121070101                  0) // edgeOM-z (vO0-z vM1-z)
  arc 38 55 (  297.507399329356   79.5073993293557                  1) // edgePQ+z (vP0+z vQ1+z)
  arc 10 27 (  297.507399329356   79.5073993293557                  0) // edgePQ-z (vP0-z vQ1-z)
  arc 48 50 (  64.0528000059646    8.9967282440308                  1) // edgeIH+z (vI1+z vH1+z)
  arc 20 22 (  64.0528000059646    8.9967282440308                  0) // edgeIH-z (vI1-z vH1-z)
);

blocks
(
    hex (0 1 19 18 28 29 47 46) fluid (20 20 1) simpleGrading (1 0.2 1)  // fluid b0 (vA0-z vB0-z vB1-z vA1-z vA0+z vB0+z vB1+z vA1+z)
    hex (1 2 11 19 29 30 39 47) fluid (60 20 1) simpleGrading (1 0.2 1)  // fluid b1 (vB0-z vC0-z vC1-z vB1-z vB0+z vC0+z vC1+z vB1+z)
    hex (2 3 12 11 30 31 40 39) fluid (20 20 1) simpleGrading (1 0.2 1)  // fluid b2 (vC0-z vD0-z vD1-z vC1-z vC0+z vD0+z vD1+z vC1+z)
    hex (3 4 13 12 31 32 41 40) fluid (20 20 1) simpleGrading (1 0.2 1)  // fluid b3 (vD0-z vEE0-z vEE1-z vD1-z vD0+z vEE0+z vEE1+z vD1+z)
    hex (4 5 14 13 32 33 42 41) fluid (10 20 1) simpleGrading (1 0.2 1)  // fluid b34 (vEE0-z vF0-z vE1-z vEE1-z vEE0+z vF0+z vE1+z vEE1+z)
    hex (5 6 15 14 33 34 43 42) fluid (60 20 1) simpleGrading (5.0 0.2 1)  // fluid b4 (vF0-z vK0-z vK1-z vE1-z vF0+z vK0+z vK1+z vE1+z)
    hex (6 7 16 15 34 35 44 43) fluid (80 20 1) simpleGrading (1 0.2 1)  // fluid b5 (vK0-z vL0-z vL1-z vK1-z vK0+z vL0+z vL1+z vK1+z)
    hex (7 8 21 16 35 36 49 44) fluid (80 20 1) simpleGrading (1 0.2 1)  // fluid b6 (vL0-z vMM0-z vMM1-z vL1-z vL0+z vMM0+z vMM1+z vL1+z)
    hex (8 9 23 21 36 37 51 49) fluid (20 20 1) simpleGrading (1 0.2 1)  // fluid b67 (vMM0-z vO0-z vM1-z vMM1-z vMM0+z vO0+z vM1+z vMM1+z)
    hex (9 10 27 23 37 38 55 51) fluid (40 20 1) simpleGrading (5.0 0.2 1)  // fluid b7 (vO0-z vP0-z vQ1-z vM1-z vO0+z vP0+z vQ1+z vM1+z)
    hex (14 15 20 17 42 43 48 45) fluid (60 40 1) edgeGrading (5.0 1 1 5.0 5.0 1 1 5.0 1 1 1 1)  // fluid b8 (vE1-z vK1-z vI1-z vJJJ1-z vE1+z vK1+z vI1+z vJJJ1+z)
    hex (17 20 22 24 45 48 50 52) fluid (60 20 1) simpleGrading (1 1 1)  // fluid b9 (vJJJ1-z vI1-z vH1-z vJJ1-z vJJJ1+z vI1+z vH1+z vJJ1+z)
    hex (24 22 26 25 52 50 54 53) fluid (60 20 1) simpleGrading (1 1 1)  // fluid b10 (vJJ1-z vH1-z vG1-z vJ1-z vJJ1+z vH1+z vG1+z vJ1+z)
);

boundary
(
    axis
    {
        type empty;
        faces
        (
            (0 1 29 28)  // f-b0-s (vA0-z vB0-z vB0+z vA0+z)
            (1 2 30 29)  // f-b1-s (vB0-z vC0-z vC0+z vB0+z)
            (2 3 31 30)  // f-b2-s (vC0-z vD0-z vD0+z vC0+z)
            (3 4 32 31)  // f-b3-s (vD0-z vEE0-z vEE0+z vD0+z)
            (4 5 33 32)  // f-b34-s (vEE0-z vF0-z vF0+z vEE0+z)
            (5 6 34 33)  // f-b4-s (vF0-z vK0-z vK0+z vF0+z)
            (6 7 35 34)  // f-b5-s (vK0-z vL0-z vL0+z vK0+z)
            (7 8 36 35)  // f-b6-s (vL0-z vMM0-z vMM0+z vL0+z)
            (8 9 37 36)  // f-b67-s (vMM0-z vO0-z vO0+z vMM0+z)
            (9 10 38 37)  // f-b7-s (vO0-z vP0-z vP0+z vO0+z)
        );
    }
    inletMain
    {
        type patch;
        faces
        (
            (0 28 46 18)  // f-b0-w (vA0-z vA0+z vA1+z vA1-z)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (10 27 55 38)  // f-b7-e (vP0-z vQ1-z vQ1+z vP0+z)
            (27 23 51 55)  // f-b7-n (vQ1-z vM1-z vM1+z vQ1+z)
        );
    }
    inletSecondary
    {
        type patch;
        faces
        (
            (26 25 53 54)  // f-b10-n (vG1-z vJ1-z vJ1+z vG1+z)
        );
    }
    wallNozzle1
    {
        type wall;
        faces
        (
            (19 18 46 47)  // f-b0-n (vB1-z vA1-z vA1+z vB1+z)
            (11 19 47 39)  // f-b1-n (vC1-z vB1-z vB1+z vC1+z)
            (12 11 39 40)  // f-b2-n (vD1-z vC1-z vC1+z vD1+z)
            (13 12 40 41)  // f-b3-n (vEE1-z vD1-z vD1+z vEE1+z)
            (14 13 41 42)  // f-b34-n (vE1-z vEE1-z vEE1+z vE1+z)
        );
    }
    wallInletSecondary
    {
        type wall;
        faces
        (
            (14 42 45 17)  // f-b8-w (vE1-z vE1+z vJJJ1+z vJJJ1-z)
            (17 45 52 24)  // f-b9-w (vJJJ1-z vJJJ1+z vJJ1+z vJJ1-z)
            (24 52 53 25)  // f-b10-w (vJJ1-z vJJ1+z vJ1+z vJ1-z)
            (22 26 54 50)  // f-b10-e (vH1-z vG1-z vG1+z vH1+z)
        );
    }
    wallDiffuser
    {
        type wall;
        faces
        (
            (16 15 43 44)  // f-b5-n (vL1-z vK1-z vK1+z vL1+z)
            (21 16 44 49)  // f-b6-n (vMM1-z vL1-z vL1+z vMM1+z)
            (23 21 49 51)  // f-b67-n (vM1-z vMM1-z vMM1+z vM1+z)
            (15 20 48 43)  // f-b8-e (vK1-z vI1-z vI1+z vK1+z)
            (20 22 50 48)  // f-b9-e (vI1-z vH1-z vH1+z vI1+z)
        );
    }
    front
    {
        type patch;
        faces
        (
            (28 29 47 46)  // f-b0-t (vA0+z vB0+z vB1+z vA1+z)
            (29 30 39 47)  // f-b1-t (vB0+z vC0+z vC1+z vB1+z)
            (30 31 40 39)  // f-b2-t (vC0+z vD0+z vD1+z vC1+z)
            (31 32 41 40)  // f-b3-t (vD0+z vEE0+z vEE1+z vD1+z)
            (32 33 42 41)  // f-b34-t (vEE0+z vF0+z vE1+z vEE1+z)
            (33 34 43 42)  // f-b4-t (vF0+z vK0+z vK1+z vE1+z)
            (34 35 44 43)  // f-b5-t (vK0+z vL0+z vL1+z vK1+z)
            (35 36 49 44)  // f-b6-t (vL0+z vMM0+z vMM1+z vL1+z)
            (36 37 51 49)  // f-b67-t (vMM0+z vO0+z vM1+z vMM1+z)
            (37 38 55 51)  // f-b7-t (vO0+z vP0+z vQ1+z vM1+z)
            (42 43 48 45)  // f-b8-t (vE1+z vK1+z vI1+z vJJJ1+z)
            (45 48 50 52)  // f-b9-t (vJJJ1+z vI1+z vH1+z vJJ1+z)
            (52 50 54 53)  // f-b10-t (vJJ1+z vH1+z vG1+z vJ1+z)
        );
    }
    back
    {
        type patch;
        faces
        (
            (0 18 19 1)  // f-b0-b (vA0-z vA1-z vB1-z vB0-z)
            (1 19 11 2)  // f-b1-b (vB0-z vB1-z vC1-z vC0-z)
            (2 11 12 3)  // f-b2-b (vC0-z vC1-z vD1-z vD0-z)
            (3 12 13 4)  // f-b3-b (vD0-z vD1-z vEE1-z vEE0-z)
            (4 13 14 5)  // f-b34-b (vEE0-z vEE1-z vE1-z vF0-z)
            (5 14 15 6)  // f-b4-b (vF0-z vE1-z vK1-z vK0-z)
            (6 15 16 7)  // f-b5-b (vK0-z vK1-z vL1-z vL0-z)
            (7 16 21 8)  // f-b6-b (vL0-z vL1-z vMM1-z vMM0-z)
            (8 21 23 9)  // f-b67-b (vMM0-z vMM1-z vM1-z vO0-z)
            (9 23 27 10)  // f-b7-b (vO0-z vM1-z vQ1-z vP0-z)
            (14 17 20 15)  // f-b8-b (vE1-z vJJJ1-z vI1-z vK1-z)
            (17 24 22 20)  // f-b9-b (vJJJ1-z vJJ1-z vH1-z vI1-z)
            (24 25 26 22)  // f-b10-b (vJJ1-z vJ1-z vG1-z vH1-z)
        );
    }
);

mergePatchPairs
(
);

defaultPatch
{
    type wall;
    name walls;
}

// ************************************************************************* //

